app/controllers/catgs_controller.rb

  def index
    @catgs = Catg.page(params[:page]).per(2)
---
SELECT "catgs".* FROM "catgs"