app/controllers/products_controller.rb

SELECT "products".* FROM "products"
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 1]]
---
  def index

    @products = Product.all
    @order_item = current_order.order_items.new

UPDATE "products" SET "description" = $1, "avatar_updated_at" = $2, "avatar_file_name" = $3, "updated_at" = $4 WHERE "products"."id" = $5
---
  def update
    respond_to do |format|
      if @product.update(product_params)